app/controllers/feed_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN (?, ?)  [["user_id", 2], ["user_id", 1]]
---
  def show
  @tweets = Tweet.where(user: current_user.all_following)