app/controllers/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]
INSERT INTO "follows" ("followable_type", "followable_id", "follower_type", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["followable_type", "User"], ["followable_id", 3], ["follower_type", "User"], ["follower_id", 3], ["created_at", "2018-08-17 18:49:56.375519"], ["updated_at", "2018-08-17 18:49:56.375519"]]
---
  def create
  	user = User.find_by(username: params[:username])
  	Follow.create(followable: user, follower: current_user)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 4]]
---
  def destroy
  	user = User.find_by(username: params[:username])
  	Follow.find_by(followable: user, follower: current_user).destroy