app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["content", "tweetje van test"], ["created_at", "2018-08-17 18:49:47.554825"], ["updated_at", "2018-08-17 18:49:47.554825"]]
---
  def create
    @tweet = current_user.tweets.new(tweet_params)
    if @tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["image_file_name", "Stoer.png"], ["image_updated_at", "2018-08-15 13:52:20.815257"], ["updated_at", "2018-08-15 13:52:20.842583"], ["id", 5]]
---
  def update
    @tweet = current_user.tweets.find(params[:id])
      if @tweet.update(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 6]]
---
  def destroy
    @tweet = current_user.tweets.find(params[:id])
    @tweet.destroy